# Coursera Week2

## Computing on Data

In [1]:
import pandas as pd
import numpy as np

In [2]:
a = [(1, 2) , (3,4), (5, 6)]
b = [(11, 12) , (13,14), (15, 16)]
c = [(1, 1) , (2,2)]

In [3]:
A = pd.DataFrame(a)
B = pd.DataFrame(b)
C = pd.DataFrame(c)
V = pd.DataFrame([1,2,3])

In [4]:
A

   0  1
0  1  2
1  3  4
2  5  6

In [5]:
B

    0   1
0  11  12
1  13  14
2  15  16

In [6]:
C

   0  1
0  1  1
1  2  2

In [7]:
V

   0
0  1
1  2
2  3

### Elementwise operations

Elementwise product:

In [8]:
A * B

    0   1
0  11  24
1  39  56
2  75  96

Power of 2

In [9]:
A.pow(2)

    0   1
0   1   4
1   9  16
2  25  36

In [10]:
1 / A # Reciprocal

          0         1
0  1.000000  0.500000
1  0.333333  0.250000
2  0.200000  0.166667

In [11]:
np.reciprocal(A*1.)

          0         1
0  1.000000  0.500000
1  0.333333  0.250000
2  0.200000  0.166667

In [12]:
np.log(V)

          0
0  0.000000
1  0.693147
2  1.098612

In [13]:
np.exp(V)

           0
0   2.718282
1   7.389056
2  20.085537

In [14]:
-A

   0  1
0 -1 -2
1 -3 -4
2 -5 -6

In [15]:
np.abs(-A)

   0  1
0  1  2
1  3  4
2  5  6

with scalars...

In [16]:
V + 1

   0
0  2
1  3
2  4

## Matrix operations

In [17]:
A.transpose()

   0  1  2
0  1  3  5
1  2  4  6

also...

In [18]:
A.T

   0  1  2
0  1  3  5
1  2  4  6

In [19]:
a = pd.DataFrame([1, 15, 2, 0.5]).T
a

     0     1    2    3
0  1.0  15.0  2.0  0.5

In [20]:
a.T.max() # max is columnwise

0    15.0
dtype: float64

In [21]:
A.max()

0    5
1    6
dtype: int64

In [22]:
A > 3 # elementwise comparison

       0      1
0  False  False
1  False   True
2   True   True

In [29]:
A.sum()

0     9
1    12
dtype: int64

In [30]:
A.prod()

0    15
1    48
dtype: int64

In [51]:
M = pd.DataFrame([(8, 1, 6) , (3, 5, 7), (4, 9, 2)])
M

   0  1  2
0  8  1  6
1  3  5  7
2  4  9  2

In [52]:
Mi = np.linalg.inv(M)
Mi = pd.DataFrame(Mi)
Mi

          0         1         2
0  0.147222 -0.144444  0.063889
1 -0.061111  0.022222  0.105556
2 -0.019444  0.188889 -0.102778

In [53]:
M.dot(Mi)

              0             1             2
0  1.000000e+00  0.000000e+00  0.000000e+00
1 -6.591949e-17  1.000000e+00  1.110223e-16
2 -3.469447e-17  5.551115e-17  1.000000e+00

In [54]:
np.dot(M, Mi)

array([[ 1.00000000e+00,  0.00000000e+00,  0.00000000e+00],
       [-6.59194921e-17,  1.00000000e+00,  1.11022302e-16],
       [-3.46944695e-17,  5.55111512e-17,  1.00000000e+00]])